
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьОписаниеПараметровДоступа(ПараметрыДоступа) Экспорт
	
	ПараметрДоступа = ПараметрыДоступа.Добавить();
	ПараметрДоступа.Имя = "ИмяСлужебногоПользователя1С";
	ПараметрДоступа.Синоним = "";
	ПараметрДоступа.РежимПароля = Ложь;
	
	ПараметрДоступа = ПараметрыДоступа.Добавить();
	ПараметрДоступа.Имя = "ПарольСлужебногоПользователя1С";
	ПараметрДоступа.Синоним = "";
	ПараметрДоступа.НеСчитыватьДанные = Истина;
	ПараметрДоступа.РежимПароля = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
